using System;
using MyMetods;

namespace Homework_8
{
    public class HW8
    {
        public static void Run()
        {
            double[,] Array2DDouble;

            //TASK1/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
            {
                Metod.Task(1, true);
                Console.WriteLine(" Задайте двумерный массив. Напишите программу, которая упорядочит по убыванию элементы каждой строки двумерного массива." +
                                  "\n\tНапример, задан массив:" +
                                  "\n\t1 4 7 2" +
                                  "\n\t5 9 2 3" +
                                  "\n\t8 4 2 4" +
                                  "\n\tВ итоге получается вот такой массив:" +
                                  "\n\t7 4 2 1" +
                                  "\n\t9 5 3 2" +
                                  "\n\t8 4 4 2\n\n");



            }

            //TASK2/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
            {
                Metod.Task(2);
                Console.WriteLine(" Задайте прямоугольный двумерный массив. Напишите программу, которая будет находить строку с наименьшей суммой элементов." +
                                  "\n\tНапример, задан массив:" +
                                  "\n\t1 4 7 2" +
                                  "\n\t5 9 2 3" +
                                  "\n\t8 4 2 4" +
                                  "\n\t5 2 6 7" +
                                  "\n\tПрограмма считает сумму элементов в каждой строке и выдаёт номер строки с наименьшей суммой элементов: 1 строка\n\n");


                
            }

            //TASK3/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
            {
                Metod.Task(3);
                Console.WriteLine(" Задайте две матрицы. Напишите программу, которая будет находить произведение двух матриц." +
                                  "\n\tНапример, даны 2 матрицы:" +
                                  "\n\t2 4 | 3 4" +
                                  "\n\t3 2 | 3 3" +
                                  "\n\tРезультирующая матрица будет:" +
                                  "\n\t18 20" +
                                  "\n\t15 18\n\n");



            }

            //TASK4/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
            {
                Metod.Task(4);
                Console.WriteLine(" Сформируйте трёхмерный массив из неповторяющихся двузначных чисел. Напишите программу, которая будет построчно выводить массив, добавляя индексы каждого элемента." +
                                  "\n\tМассив размером 2 x 2 x 2" +
                                  "\n\t66(0,0,0) 25(0,1,0)" +
                                  "\n\t34(1,0,0) 41(1,1,0)" +
                                  "\n\t27(0,0,1) 90(0,1,1)" +
                                  "\n\t26(1,0,1) 55(1,1,1)\n\n");



            }

            //TASK5/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
            {
                Metod.Task(5);
                Console.WriteLine(" Напишите программу, которая заполнит спирально массив 4 на 4." +
                                  "\n\tНапример, на выходе получается вот такой массив:" +
                                  "\n\t01 02 03 04" +
                                  "\n\t12 13 14 05" +
                                  "\n\t11 16 15 06" +
                                  "\n\t10 09 08 07\n\n");



            }

        }
    }
}
